Autodesk.Revit.DB.Electrical.InsulationTypeSet
A set that contains insulation types.

Autodesk.Revit.DB.Electrical.InsulationTypeSet.Insert(Autodesk.Revit.DB.Electrical.InsulationType)
System.Int32
Insert the specified insulation type into the set.
item: The insulation type to be inserted into the set.
Returns: Returns whether the insulation type was inserted into the set.

Autodesk.Revit.DB.Electrical.InsulationTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Electrical.InsulationTypeSet.ReverseIterator
Autodesk.Revit.DB.Electrical.InsulationTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.Electrical.InsulationTypeSet.ForwardIterator
Autodesk.Revit.DB.Electrical.InsulationTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Electrical.InsulationTypeSet.Erase(Autodesk.Revit.DB.Electrical.InsulationType)
System.Int32
Removes a specified insulation type from the set.
item: The insulation type to be erased.
Returns: The number of insulation types that were erased from the set.

Autodesk.Revit.DB.Electrical.InsulationTypeSet.Contains(Autodesk.Revit.DB.Electrical.InsulationType)
System.Boolean
Tests for the existence of a insulation type within the set.
item: The insulation type to be searched for.
Returns: The Contains method returns True if the insulation type is within the set, otherwise False.

Autodesk.Revit.DB.Electrical.InsulationTypeSet.Clear
void
Removes every insulation type from the set, rendering it empty.

Autodesk.Revit.DB.Electrical.InsulationTypeSet.Size
System.Int32
get
Returns the number of insulation types that are in the set.

Autodesk.Revit.DB.Electrical.InsulationTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.